/*
modifyData ::
 [
  [ 'MA012S',
    'MA012S-7',
    'XS',
    'Jacket',
    [ '袖長', '肩寬', '胸寬', '腰寬', '下擺寬', '衣長', '袖寬' ],
    [ [Array], [Array], [Array], [Array], [Array], [Array], [Array] ],
    '袖長:62.5 肩寬:46.6 胸寬:54 腰寬:48.5 下擺寬:49 衣長:63 袖寬:20.6',
    '袖長:62.5 肩寬:46.6 胸寬:54 腰寬:48.5 下擺寬:49 衣長:63 袖寬:20.6' 
  ],
  [ 'MA012S',
    'MA012S-7',
    'XS',
    'Jacket',
    [ '袖長', '肩寬', '胸寬', '腰寬', '下擺寬', '衣長', '袖寬' ],
    [ [Array], [Array], [Array], [Array], [Array], [Array], [Array] ],
    '袖長:62.5 肩寬:46.6 胸寬:54 腰寬:48.5 下擺寬:49 衣長:63 袖寬:20.6',
    '袖長:62.5 肩寬:46.6 胸寬:54 腰寬:48.5 下擺寬:49 衣長:63 袖寬:20.6' 
  ],
]
*/

/*
unitifyData
{ 
  'MA002T-7': [ '尺碼', '袖長', '肩寬', '胸寬', '腰寬', '下擺寬', '衣長', '袖寬' ],
  'MA010R-21': [ '尺碼', '袖長', '肩寬', '胸寬', '腰寬', '下擺寬', '衣長', '袖寬' ],
  'MA012S-7': [ '尺碼', '袖長', '肩寬', '胸寬', '腰寬', '下擺寬', '衣長', '袖寬' ],
  'MA014S-2160': [ '尺碼', '袖長', '肩寬', '胸寬', '下擺寬', '衣長', '袖寬' ] 
}
*/

/*
finalData :: {
  'MA010R-21': [['S', '12', '23', '34'], ['M', '12', '23', '34']],
  'MA010R-22': [['S', '12', '23', '34'], ['M', '12', '23', '34']]
}
*/
